---
date: 19-04-2025
tags:
  - problem
---
# Задача:
Что нужно?

Вход:
В первой строке вводится одно натуральное число N (1≤N≤100000) — количество чисел в массиве.

Во второй строке вводятся N чисел от 0 до 100000 — элементы массива.

В третьей строке вводится одно натуральное число M (1≤M≤30000) — количество запросов.

Каждая из следующих M строк представляет собой описание запроса. Сначала вводится одна буква, кодирующая вид запроса (s — вычислить максимум, u — обновить значение элемента).

Следом за s вводятся два числа — номера левой и правой границы отрезка.

Следом за u вводятся два числа — номер элемента и его новое значение.

Выход:
для каждого s нужно вычислить результат на отрезке
все результаты вывести в одну строку через пробел

Есть какие-то шаблоны?
Есть ли возможность декомпозиции на частные случаи или на более простые задачи?
# Draft

код можно дополнить из [[Количество максимумов на отрезке]]
# Code

```python
import math  
  
N = int(input())  
grade = math.log(N, 2)  
if int(grade) != grade:  
    grade = int(grade) + 1  
N = 2 ** grade  
  
tmp = list(input().split())  
neutral = -float('inf')  
arr = []  
for i in range(N):  
    if i >= len(tmp):  
        arr.append([neutral, 1, (i, i)])  
    else:  
        arr.append([int(tmp[i]), 1, (i, i)])  
del tmp  
arr = [[neutral, 1, (-1, -1)] for _ in range(N - 1)] + arr  
  
for i in range(N - 2, -1, -1):  
    child_1 = arr[2 * i + 1]  
    child_2 = arr[2 * i + 2]  
  
    if child_1[0] == child_2[0]:  
        arr[i][0] = child_1[0]  
        arr[i][1] = child_1[1] + child_2[1]  
    elif child_1[0] > child_2[0]:  
        arr[i][0] = child_1[0]  
        arr[i][1] = child_1[1]  
    else:  
        arr[i][0] = child_2[0]  
        arr[i][1] = child_2[1]  
  
    arr[i][2] = (child_1[2][0], child_2[2][1])  
  
  
# print(arr)  
def find_max(l, r, i):  
    # print('элемент под индексом', i)  
    maximum, count, segment = arr[i]  
    # print('максимум', maximum)  
    # print('количество', count)    # print('отрезок', segment)  
    if segment[1] < l or segment[0] > r:  
        # print('рассматриваемый отрезок вне запрашиваемого отрезка')  
        return neutral, 1  
    if segment[0] >= l and segment[1] <= r:  
        # print('рассматриваемый отрезок является подотрезком запрашиваемого - возвращаем его')  
        return maximum, count  
    # иначе надо обратиться к потомкам, чтобы выяснить ответ  
    # print('обращаемся к потомкам')    # print(2 * i + 1)    # print(2 * i + 2)    max_1, count_1 = find_max(l, r, 2 * i + 1)  
    max_2, count_2 = find_max(l, r, 2 * i + 2)  
    if max_1 == max_2:  
        return max_1, count_1 + count_2  
    if max_1 > max_2:  
        return max_1, count_1  
    if max_1 < max_2:  
        return max_2, count_2  
  
  
def change(number, new_el):  
    i = number - 1 + N - 1  
    arr[i][0] = new_el  
    arr[i][1] = 1  
    while i >= 0:  
        i = (i - 1) // 2  
        child_1 = arr[2 * i + 1]  
        child_2 = arr[2 * i + 2]  
        if child_1[0] == child_2[0]:  
            arr[i][0] = child_1[0]  
            arr[i][1] = child_1[1] + child_2[1]  
        elif child_1[0] > child_2[0]:  
            arr[i][0] = child_1[0]  
            arr[i][1] = child_1[1]  
        else:  
            arr[i][0] = child_2[0]  
            arr[i][1] = child_2[1]  
  
  
  
K = int(input())  
results = []  
  
for _ in range(K):  
    inp = input().split()  
    if inp[0] == 's':  
        l, r = map(lambda x: int(x) - 1, inp[1:])  
        results.append(find_max(l, r, 0)[0])  
    elif inp[0] == 'u':  
        number, new_el = map(int, inp[1:])  
        change(number, new_el)  
print(*results)
```

# Review

